# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


import random
n = int(input('Введите размер строки '))
res = random.sample(range(0, 20), n)

print(res)

prod = []
for i in range((len(res)+1)//2):
    prod.append(res[i]*res[len(res)-1-i])

print(prod)
